In [9]:
import pandas as pd

melb_df = pd.read_csv('data/melb_data_fe.csv', sep = ',', decimal = '.')
melb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 26 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Suburb           13580 non-null  object
 1   Rooms            13580 non-null  int64
 2   Type             13580 non-null  object
 3   Price            13580 non-null  float64
 4   Method           13580 non-null  object
 5   SellerG          13580 non-null  object
 6   Date             13580 non-null  object
 7   Distance         13580 non-null  float64
 8   Postcode         13580 non-null  int64
 9   Bedroom          13580 non-null  int64
 10  Bathroom         13580 non-null  int64
 11  Car              13580 non-null  int64
 12  Landsize         13580 non-null  float64
 13  BuildingArea     13580 non-null  float64
 14  CouncilArea      12211 non-null  object
 15  Lattitude        13580 non-null  float64
 16  Longtitude       13580 non-null  float64
 17  Regionname       13580 non-null  object
 18  Propertycount    13580 non-null  int64
 19  MeanRoomsSquare  13580 non-null  float64
 20  AreaRatio        13580 non-null  float64
 21  MonthSale        13580 non-null  int64
 22  AgeBuilding      13580 non-null  int64
 23  WeekdaySale      13580 non-null  int64
 24  StreetType       13580 non-null  object
 25  Weekend          13580 non-null  int64
dtypes: float64(8), int64(10), object(8)
memory usage: 2.7+ MB

In [10]:
# 2.2

melb_df.sort_values(by = 'AreaRatio', ascending = False, ignore_index = True).loc[1558, 'BuildingArea']

126.0

In [11]:
# 2.3

round(melb_df[(melb_df['Rooms'] > 2) & (melb_df['Type'] == 'townhouse')].sort_values(
    by = ['Rooms', 'MeanRoomsSquare'], ascending = [True, False], ignore_index = True
    ).loc[18, 'Price'])

1300000

In [12]:
# 3.1

melb_df.groupby('Rooms')['Price'].mean().sort_values(ascending = False)

Rooms
7     1.920700e+06
5     1.870260e+06
6     1.849366e+06
8     1.602750e+06
4     1.445282e+06
3     1.076081e+06
10    9.000000e+05
2     7.750812e+05
1     4.338245e+05
Name: Price, dtype: float64

In [13]:
# 3.2

melb_df.groupby('Regionname')['Lattitude'].std().sort_values(ascending = True)
melb_df['Date']

0        2016-03-12
1        2016-04-02
2        2017-04-03
3        2017-04-03
4        2016-04-06
            ...
13575    2017-08-26
13576    2017-08-26
13577    2017-08-26
13578    2017-08-26
13579    2017-08-26
Name: Date, Length: 13580, dtype: object

In [14]:
melb_df['Date'] = pd.to_datetime(melb_df['Date'])
melb_df['Month'] = melb_df['Date'].dt.month
melb_df['Year'] = melb_df['Date'].dt.year
melb_df[(melb_df['Month'] <= 10) & (melb_df['Month'] >= 4) & (melb_df['Year'] == 2017)].groupby(by = 'SellerG')['Price'].count().sort_values(ascending=True)

SellerG
LITTLE             5
Cayzer             8
Burnham            9
Moonee            12
Alexkarbon        13
Nick              13
Thomson           15
McDonald          18
Collins           18
Rendina           19
Bells             19
Chisholm          22
Buckingham        28
Philip            30
Purplebricks      31
Eview             32
Williams          32
C21               34
Kay               35
Douglas           39
O'Brien           39
Village           39
RW                45
Love              45
Gary              46
RT                47
HAR               49
Miles             57
Raine             58
Hodges            59
Stockdale         65
Sweeney           70
Greg              87
Jas               89
Noel              89
YPA              102
Brad             102
Harcourts        103
McGrath          105
Woodards         107
Fletchers        113
Biggin           135
Marshall         199
Buxton           246
Ray              373
Barry            415
Jellis           437
hockingstuart    440
other            510
Nelson           511
Name: Price, dtype: int64

In [15]:
# 4.2

melb_df.pivot_table(values = 'BuildingArea', index = 'Rooms', columns = 'Type', aggfunc = 'median')

Type   house  townhouse   unit
Rooms
1      126.0       88.0   69.5
2      126.0      114.0  110.0
3      126.0      126.0  126.0
4      141.0      159.5  126.0
5      177.0      152.0    NaN
6      126.0        NaN  171.0
7      216.5        NaN    NaN
8      126.0        NaN  126.0
10     126.0        NaN    NaN

In [16]:
# 4.3

for_4_3 = melb_df.pivot_table(values = 'Price', index = 'SellerG', columns = 'Type', aggfunc = 'median', fill_value = 0)
for_4_3['unit'].sort_values(ascending=False)

SellerG
Nick             900000
Marshall         715000
Cayzer           707500
Kay              695000
Noel             693250
Buxton           670000
Fletchers        653000
Chisholm         640000
Philip           636000
RT               630000
C21              625500
RW               625500
Moonee           622000
O'Brien          618500
Hodges           605500
Eview            602000
Woodards         600000
Collins          592000
Jellis           591750
Purplebricks     582500
Williams         577000
hockingstuart    566000
Alexkarbon       560000
Miles            555000
Buckingham       553000
Gary             550000
Biggin           548000
Greg             547500
McGrath          542500
other            535000
Nelson           530000
HAR              518000
McDonald         502500
Barry            502000
Harcourts        500000
Ray              497500
Thomson          495000
Douglas          494500
Brad             465000
Rendina          459000
Bells            457500
Jas              455000
Raine            447500
LITTLE           447000
YPA              443500
Love             440000
Village          420000
Stockdale        410000
Sweeney          381000
Burnham          305000
Name: unit, dtype: int64

In [56]:
import re 
def get_year_release(arg):
    #находим все слова по шаблону "(DDDD)"
    candidates = re.findall(r'\(\d{4}\)', arg) 
    # проверяем число вхождений
    if len(candidates) > 0:
        #если число вхождений больше 0,
	#очищаем строку от знаков "(" и ")"
        year = candidates[0].replace('(', '')
        year = year.replace(')', '')
        return int(year)
    else:
        #если год не указан, возвращаем None
        return None

In [57]:
movies = pd.read_csv('data/movies.csv', sep = ',', decimal = '.')
ratings1 = pd.read_csv('data/ratings1.csv', sep = ',', decimal = '.')
ratings2 = pd.read_csv('data/ratings2.csv', sep = ',', decimal = '.')
dates = pd.read_csv('data/dates.csv', sep = ',', decimal = '.')

In [58]:
ratings = pd.concat([ratings1, ratings2], ignore_index=True)
ratings = ratings.drop_duplicates(ignore_index=True)
ratings

        userId  movieId  rating
0            1        1     4.0
1            1        3     4.0
2            1        6     4.0
3            1       47     5.0
4            1       50     5.0
...        ...      ...     ...
100831     610   166534     4.0
100832     610   168248     5.0
100833     610   168250     5.0
100834     610   168252     5.0
100835     610   170875     3.0

[100836 rows x 3 columns]

In [59]:
rating_dates = pd.concat([ratings, dates], axis=1)
rating_dates

        userId  movieId  rating                 date
0            1        1     4.0  2000-07-30 18:45:03
1            1        3     4.0  2000-07-30 18:20:47
2            1        6     4.0  2000-07-30 18:37:04
3            1       47     5.0  2000-07-30 19:03:35
4            1       50     5.0  2000-07-30 18:48:51
...        ...      ...     ...                  ...
100831     610   166534     4.0  2017-05-03 21:53:22
100832     610   168248     5.0  2017-05-03 22:21:31
100833     610   168250     5.0  2017-05-08 19:50:47
100834     610   168252     5.0  2017-05-03 21:19:12
100835     610   170875     3.0  2017-05-03 21:20:15

[100836 rows x 4 columns]

In [96]:
# 8.1

merged = rating_dates.merge(movies, on='movieId', how='left')
merged['year_release'] = merged['title'].apply(get_year_release)
merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100836 entries, 0 to 100835
Data columns (total 7 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   userId        100836 non-null  int64
 1   movieId       100836 non-null  int64
 2   rating        100836 non-null  float64
 3   date          100836 non-null  object
 4   title         100836 non-null  object
 5   genres        100836 non-null  object
 6   year_release  100818 non-null  float64
dtypes: float64(2), int64(2), object(3)
memory usage: 6.2+ MB

In [122]:
# 8.2

merged[merged['year_release'] == 1999].groupby(by='title').agg('max').sort_values(by='rating')

,userId,movieId,rating,date,genres,year_release
title,,,,,,
Bloodsport: The Dark Kumite (1999),610,145951,0.5,2017-05-03 22:03:39,Action|Thriller,1999.0
Simon Sez (1999),448,2887,1.0,2003-01-08 18:09:48,Action|Comedy,1999.0
Trippin' (1999),575,2623,1.0,1999-05-12 12:03:17,Comedy,1999.0
Julien Donkey-Boy (1999),275,2964,1.0,2003-03-31 02:47:13,Drama,1999.0
From Dusk Till Dawn 2: Texas Blood Money (1999),599,27008,1.0,2018-02-22 21:05:08,Comedy|Crime|Horror,1999.0
...,...,...,...,...,...,...
"Iron Giant, The (1999)",608,2761,5.0,2018-02-20 09:13:50,Adventure|Animation|Children|Drama|Sci-Fi,1999.0
"World Is Not Enough, The (1999)",608,3082,5.0,2017-08-08 20:00:11,Action|Adventure|Thriller,1999.0
Larry David: Curb Your Enthusiasm (1999),424,136469,5.0,2016-03-13 04:44:23,Comedy,1999.0
Payback (1999),608,2490,5.0,2018-06-25 04:02:22,Action|Thriller,1999.0
eXistenZ (1999),608,2600,5.0,2017-06-27 01:46:35,Action|Sci-Fi|Thriller,1999.0

In [129]:
# 8.3

merged[merged['year_release'] == 2010].groupby(by='genres').mean().sort_values(by='rating')

C:\Users\qwert\AppData\Local\Temp\ipykernel_15992\3943379023.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  merged[merged['year_release'] == 2010].groupby(by='genres').mean().sort_values(by='rating')

,userId,movieId,rating,year_release
genres,,,,
Action|Sci-Fi,210.000000,189547.0,1.000000,2010.0
Action|Adventure|Horror,382.000000,93139.0,1.500000,2010.0
Action|Drama|Fantasy,448.000000,91273.0,1.500000,2010.0
Crime|Romance,448.000000,82093.0,1.500000,2010.0
Adventure|Comedy|Fantasy,291.333333,82854.0,1.833333,2010.0
...,...,...,...,...
Crime,40.000000,185135.0,4.750000,2010.0
Comedy|Musical,177.000000,93008.0,5.000000,2010.0
Animation|Drama|Fantasy|Mystery,371.000000,112512.0,5.000000,2010.0
Adventure|Children|Comedy|Mystery,89.000000,85295.0,5.000000,2010.0
Animation|Children|Mystery,89.000000,118894.0,5.000000,2010.0

In [145]:
# 8.4

merged.groupby(by='userId')['genres'].nunique().sort_values()

userId
214     13
85      13
245     13
494     15
578     15
      ...
474    395
380    399
448    403
414    482
599    524
Name: genres, Length: 610, dtype: int64

In [146]:
# 8.5

merged.groupby('userId')['rating'].agg(['mode, max'])

AttributeError: 'SeriesGroupBy' object has no attribute 'mode, max'